---
kind: property
id: P:Autodesk.Revit.DB.Electrical.TemperatureRatingType.IsInUse
source: html/299c4fea-6792-f095-ddeb-a5f0369c9b67.htm
---
# Autodesk.Revit.DB.Electrical.TemperatureRatingType.IsInUse Property

Indicate whether the temperature rating type is in use.

## Syntax (C#)
```csharp
public bool IsInUse { get; }
```